<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/ktoon.css" />
</head>
<body class="ktoon_background2">
<p class="title">M&oacute;dulo de Animaci&oacute;n</p>
<p class="paragraph">
A trav&es de este m&oacute;dulo puedes darle una mirada a tu proyecto a medida que lo construyes. Gracias a este recurso, puedes detectar en que puntos de la l&iacute;nea de tiempo tu animaci&oacute;n necesita de ajustes, adicionar m&aacute;s marcos o tal vez cambiar la velocidad a la que quieres que las imagenes fluyan, todo depende de ti, recuerda que eres el director!<br/>
</p>
<center>
<img src="./images/animation_shot.png"/>
<p class="paragraph">
<b>Fig #1.</b> Interfaz M&oacute;dulo de Animaci&oacute;n <b>KTooN</b>    
</p>
</center>
<p class="paragraph">
<b>TIP:</b> Cada vez que desees consultar el <b>M&oacute;dulo de Animaci&oacute;n</b>, s&oacute;lo debes presionar la tecla <b>F10</b>.
</p>
<p class="paragraph">
Muy bien, ahora veamos cuales son las herramientas que hacen parte de este m&oacute;dulo:
</p>
<p class="paragraph">
<b>Panel de Control</b>
<br/>
Si alguna vez has usado un DVD, una grabadora o un equipo de sonido, seguramente ya sabes cual es la funci&oacute;n de este componente. Es correcto, gracias a este conjunto de botones puedes reproducir, detener y devolver tu proyecto de animaci&oacute;n todas las veces que quieras, que seguramente ser&aacute;n muchas, pues es a partir de la observaci&oacute;n continua y cuidadosa de tu trabajo, que detectas posibles errores en tu animaci&oacute;n y realizas los respectivos ajustes, logrando que el resultado sea cada vez m&aacute;s fluido y que con el tiempo, tus proyectos sean m&aacute;s sorprendentes.
</p>
<center>
<img src="./images/controls_panel.png"/>
<p class="paragraph">
<b>Fig #n.</b> Panel de Control
</p>
</center>
<p class="paragraph">
<b>Panel de Propiedades</b>
<br/>
Este panel, ubicado en la parte inferior del panel de controles, cumple con tres funciones muy importantes:
<ul>
<li> Nos ofrece informaci&oacute;n de inter&eacute;s acerca de nuestro proyecto</li> 
<li> Nos permite modificar la velocidad de la animaci&oacute;n</li>
<li> Nos permite convertir nuestro proyecto de animaci&oacute;n en un archivo de v&iacute;deo</li>
</ul>
</p>
<center>
<img src="./images/properties_panel.png"/>
<p class="paragraph">
<b>Fig #n.</b> Panel de Propiedades
</p>
</center>
</body>
</html>
