<html>
<head>
<link rel="stylesheet" type="text/css" href="../css/ktoon.css" />
</head>
<body class="ktoon_background3">
<p class="title">Veamos c&oacute;mo est&aacute; quedando</p>
<p class="paragraph">
Muy bien, ya tenemos la mitad de los marcos de nuestro proyecto terminados. Es momento de aprender a utilizar el M&oacute;dulo de Animaci&oacute;n. Vale la pena decir que no hay una regla general acerca de cuantos marcos debes crear antes de hacer una previsualizaci&oacute;n de tu proyecto, esta es otra habilidad que desarrollas a partir de la pr&aacute;ctica, en otras palabras: t&uacute; escoges.<br/>
</p>
<center>
<table>
<tr>
<td>
<img src="./images/preview01.png"/>
</td>
<td>
<img src="./images/preview02.png"/>
</td>
</tr>
</table>
<p class="paragraph">
<b>Fig #n.</b> Vista previa del proyecto desde el M&oacute;dulo de Animaci&oacute;n 
</p>
</center>
<p class="paragraph">
Adicionalmente, ten en cuenta que realizar una previsualizaci&oacute;n de tu animaci&oacute;n no afecta tu proyecto en lo absoluto, por lo tanto, podr&aacute;s ingresar a este m&oacute;dulo tantas veces como as&iacute; lo desees, lo verdaderamente importante es que lo aproveches para detectar que tan a gusto te sientes con el resultado final y que puedas corregir los errores que descubras a tiempo.<br/> 
La interfaz de previsualizaci&oacute;n es bastante sencilla, as&iacute; que no hay nada de que preocuparse. El panel de botones contiene todos los controles necesarios para hacer una previsualizaci&oacute;n de tu animaci&oacute;n, paso a paso o de manera cont&iacute;nua.
</p>
<p class="paragraph">
<b>Tip:</b> La opci&oacute;n "Repetir" es bastante &uacute;til si tienes pocos marcos y quieres tener una apreciaci&oacute;n m&aacute;s precisa acerca de la fluidez de tu proyecto y puedes activarla o desactivarla cada vez que lo desees. 
</p>
<p class="paragraph">
Muy bien, ahora es momento de seguir dibujando nuevos marcos hasta cumplir con todo el recorrido propuesto en el gui&oacute;n. 
Regresa a la secci&oacute;n anterior, y termina con todos los gr&aacute;ficos pendientes. 
Es probable que te parezca desgastante tener que dibujar las mismas partes de ciertos objetos o personajes una y otra vez, y estamos de acuerdo contigo. Es por esto que nos encontramos trabajando en una funcionalidad llamada "Tweening", que sirve para ahorrarte mucho tiempo al momento de ilustrar y que esperamos tener lista muy pronto. 
</p>
<p class="paragraph">
Ya terminaste de crear todos los marcos? te gusta lo que ves en Modulo de Animacion? Muy bien, es hora de crear tu archivo de video! 
</p>
</body>
</html>
